// - Дано натуральное число n. Выведите все числа от 1 до n.
// let n = 85;
// let numbern = (n,i) => {
// for (;i < n; i++){
//     if (i !== n){
//     console.log(i)}
// }
// }
// numbern(n,0)
// - Даны два целых числа A и В . Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.
// let a = 17;
// let  b = 50;
// let numberab = (a,b) => {
//     for (;a <= b; a++){
//         console.log(a)
//     }
// }
// numberab(a,b);
// -   функція Приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
//   EXAMPLE:5
//   foo([9,8,0,4], 0) // ==> [ 8, 9, 0, 4 ]
//   foo([9,8,0,4], 1) // ==> [ 9 ,0, 8, 4 ]
//   foo([9,8,0,4], 2) // ==> [ 9, 8, 4, 0 ]
// let foo = ([9,8,0,4]);
// let exchange = (f,o) => {
//    if (o < f.length ) {
//        let mas = f[o];
//        f[o] = f[o + 1]
//        f[o + 1] = mas
//        console.log(f);
//    }
// }
// exchange(foo,0)
// - Сворити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
//     Двожина масиву від 2 до 100
// EXAMPLE:
//     [1,0,6,0,3] => [1,6,3,0,0]
//     [0,1,2,3,4] => [1,2,3,4,0]
//     [0,0,1,0]   => [1,0,0,0]
// let xmas = [1,0,6,0,3,0,7,8];
// let zeronomber =(xm)=> {
//     let zero = [];
//     let nozero = [];
//     for (i of xm){
//        if (i !== 0){
//            nozero.push(i)
//
//        } else  {zero.push(i)}
//         }for (item of zero){
//         nozero.push(item);
//     }
//     console.log(nozero)
// } ;
// zeronomber(xmas)
