// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
let time = Math.floor(Math.random() * 60);
if (time <= 15 && 0 <= time ){
    console.log('one')
}
else if (time > 15 && time <= 30){
    console.log('two')
} else if (time > 30 && time <= 45){
    console.log('three')
}
else if (time > 45){
    console.log('four')
}
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// let day = Math.floor(Math.random() * 32);
// if (day <= 10){
//     console.log('one');
// }
// else if (day <= 20){
//     console.log('two');
// }
// else {
//     console.log('three');
// }
// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = Math.floor(Math.random()* (0,2));
// if (test != true){
//     console.log('Вірно')
// }
// else console.log('Неправильно');
// console.log(test);
//
// test != true?  console.log('Вірно') :console.log('Неправильно');

// - Якщо змінна a не дорівнює нулю, виведіть , інакше виведіть . Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let a = prompt( 'введітm 1, 0, -3');
// a == 0? console.log('Вірно'):console.log('Невірно');
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
// let namber = +prompt('який зараз день?');
// switch (namber){
//     case 1:
//     case 2:
//     case 3:
//     case 4:
//     case 5:
//         alert('йди працюй');
//         break;
//     case 6:
//         alert('у першій половині дня працюй у другій половині можеш відпочити, а вечір йди пиво пий');
//         break;
//     case 7:
//         alert('йди до церкви, а потім можеш відпочити');
//         break;
//     default:
//         alert('упс, ти щось не те ввів');
// }
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
// let year = +prompt('який зараз рік?')
// year % 4 === 0? alert('рік високосний'): alert('рік не високосний');

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let js = prompt('Яка «офіційна» назва JavaScript?');
// if (js === 'ECMAScript'){
//     alert('Правильно');
// }
// else {
//     alert('Не знаєте? ECMAScript!');
// }