// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
friends.length >= 3? console.log('це великий масив, в якому  3 і більше елементи'):console.log('це маленький масив, в якому менше 3-х елементів');

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let a = 6;
let b = 4;
let c = 10;
if (a < b && a > c || a > b && a < c){
    console.log(a);
}
else if (b < a && b > c || b > a && b < c){
    console.log(b);
}
else if (c < a && c > b || c > a && c < b){
    console.log(c);
}
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
result = a + b < 4? 'Мало': 'Багато';
console.log(result);
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
let namb = +prompt('введіть число ');
namb === 0? console.log('число є нулем'):namb < 0 && namb >= -100? console.log('число є негативним'):namb > 0 && namb <= 100? console.log('чисдл є позитивним'): console.log('ви щось не те ввели');

